Autodesk.Revit.DB.IFCCategoryTemplate.SetMappingInfo(Autodesk.Revit.DB.ExportIFCCategoryKey,Autodesk.Revit.DB.ExportIFCCategoryInfo)
Set the mapping info for the key.
key:
The key.
info:
The info.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.SetMappingInfo(System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ExportIFCCategoryKey,Autodesk.Revit.DB.ExportIFCCategoryInfo})
Set the mapping info for multiple keys.
newMap:
The updated map.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.GetMappingInfoById(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.CustomSubCategoryId)
Gets a copy of ifc mapping info by category id.
document:
A Revit document.
categoryId:
The category id.
customSubCategoryId:
The custom subcategory id.
Returns:
Return the info for this category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.IsValidName(Autodesk.Revit.DB.Document,System.String)
Returns result that the proposed name is valid and not exist in the specified document.
Remarks:
Name can't contains following characters, such as { } [ ] | ; < > ? ` ~ \ : \r \n \f \t \v.
Name can't be blank.
If true, the name is valid and not exist in specified document.
If false, the name is not a valid name which means it does not exist in specified document.
document:
Document to check
name:
Name to check.
Returns:
Whether or not the name is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.ListNames(Autodesk.Revit.DB.Document)
Returns a list of names of ifc export mapping templates.
document:
A Revit document to retrieve names from.
Returns:
An array of strings representing names of predefined setups.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.ResetCategoryToDefault(Autodesk.Revit.DB.ExportIFCCategoryKey)
Reset one category, sub-category, or special category in the current mapping table to the default values defined in Revit
categoryKey:
The selected category information.
Returns:
The default information.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.CopyTemplate(Autodesk.Revit.DB.Document,System.String)
Create copy of mapping template with new name.
document:
A Revit document.
copyTemplateName:
A name for copied template name.
Returns:
The copied mapping template element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create IFCCategoryTemplate element.
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.ExportToFile(Autodesk.Revit.DB.Document,System.String)
Export mapping template to a text file.
document:
A Revit document.
fileName:
A full text file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Failed to access the text file.
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.UpdateCategoryList(Autodesk.Revit.DB.Document)
Updates the mapping table with the categories from the document.
document:
A Revit document to retrieve names from.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.GetCategoryMappingTable(Autodesk.Revit.DB.Document)
Gets the table that contains a mapping from Revit categories to IFC entities.
document:
The document.
Returns:
The mapping table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.SetActiveTemplate(Autodesk.Revit.DB.Document)
Sets the mapping template element to be the active mapping template in the document.
document:
The document to set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.ImportFromFile(Autodesk.Revit.DB.Document,System.String,System.String)
Import mapping template from a text file.
document:
A Revit document.
fileName:
A full text file name.
templateName:
A mapping template name.
Returns:
The mapping template element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Failed to access the text file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create IFCCategoryTemplate element.
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.ResetActiveTemplate(Autodesk.Revit.DB.Document)
Sets the mapping template element to be the active mapping template in the document.
document:
The document to set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.GetActiveTemplate(Autodesk.Revit.DB.Document)
Gets the active mapping template element in the document.
document:
The document to find the active mapping template.
Returns:
The active mapping template, or nullptr if none.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.GetOrCreateInSessionTemplate(Autodesk.Revit.DB.Document)
Gets the in-session non-serializable template or create new.
document:
The document to find the in-session mapping template.
Returns:
The mapping template, or nullptr if none.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.FindByName(Autodesk.Revit.DB.Document,System.String)
Returns mapping template element by name.
document:
The document to find the mapping template with the specified name.
name:
Name of the mapping template to find.
Returns:
The mapping template element, or nullptr if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.Create(Autodesk.Revit.DB.Document,System.String)
Create a IFC category mapping template with default values.
document:
Document where created mapping template is saved.
name:
The name specified to this mapping template.
Returns:
The new mapping template instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.#ctor(Autodesk.Revit.DB.Document)
Custom constructor for this element.
document:
Document where created template is saved.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate
Represents an element that contains an IFC category mapping template stored in a Revit document.
Since:
2025